backend/app/controllers/devotionals_controller.rb

  def index
    @devotionals = Devotional.where(user: @user.id).all
---
SELECT "devotionals".* FROM "devotionals" WHERE "devotionals"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]

  def show
    @devotional = Devotional.includes(:comments, :impressions).find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."devotional_id" = $1  [["devotional_id", 10]]
SELECT "devotionals".* FROM "devotionals" WHERE "devotionals"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT "impressions".* FROM "impressions" WHERE "impressions"."devotional_id" = $1  [["devotional_id", 10]]

  def show_all
    @deviotionals = Devotional.where(is_public: true).all
---
SELECT "devotionals".* FROM "devotionals" WHERE "devotionals"."is_public" = $1 LIMIT $2  [["is_public", true], ["LIMIT", 1]]

  def create
    scriptures = devotional_params[:scriptures].map(&:downcase)
    devotional_params[:scriptures] = scriptures

    @devotional = Devotional.new(devotional_params)

    # Check if all scriptures are valid
    if params[:devotional][:scriptures].all? { |scripture| valid_scripture?(scripture) }
      if @devotional.save
---
INSERT INTO "devotionals" ("title", "scriptures", "body", "is_markdown", "is_public", "template", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    @devotional = Devotional.find(params[:id])

    # Check if all scriptures are valid
    if params[:devotional][:scriptures].all? { |scripture| valid_scripture?(scripture) }
      if @devotional.update(devotional_params)
---
SELECT "devotionals".* FROM "devotionals" WHERE "devotionals"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "devotionals" SET "scriptures" = $1, "updated_at" = $2 WHERE "devotionals"."id" = $3  [["scriptures", "{\"Scripture 1\",\"Scripture 2\"}"], ["updated_at", "2024-04-12 09:02:53.112953"], ["id", 17]]

  def set_devotional
    @devotional = Devotional.find(params[:id])
---
SELECT "devotionals".* FROM "devotionals" WHERE "devotionals"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]