backend/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "default_translation", "created_at", "updated_at", "profile_pictures", "nickname", "favorite_verse", "email", "phone") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    return unless validate_user_creation_params

    # Create a new user
    @user = User.create(user_creation_params)

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "test8"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "why@hello.hi"], ["LIMIT", 1]]
---
  def validate_user_creation_params
    # Ensure that either email or phone number is provided
    if params[:email].nil?
      render json: { error: 'Email required' }
      return false
    end
    # Check if user if already exists
    if User.find_by(username: params[:username])
      render json: { error: 'Username already exists' }
      return false
    end
    if User.find_by(email: params[:email])